import os
from tkinter import *
from tkinter import filedialog

print(r"""
███████╗████████╗███████╗ █████╗ ███╗   ███╗     ██████╗██████╗  █████╗  ██████╗██╗  ██╗███████╗██████╗ 
██╔════╝╚══██╔══╝██╔════╝██╔══██╗████╗ ████║    ██╔════╝██╔══██╗██╔══██╗██╔════╝██║ ██╔╝██╔════╝██╔══██╗
███████╗   ██║   █████╗  ███████║██╔████╔██║    ██║     ██████╔╝███████║██║     █████╔╝ █████╗  ██████╔╝
╚════██║   ██║   ██╔══╝  ██╔══██║██║╚██╔╝██║    ██║     ██╔══██╗██╔══██║██║     ██╔═██╗ ██╔══╝  ██╔══██╗
███████║   ██║   ███████╗██║  ██║██║ ╚═╝ ██║    ╚██████╗██║  ██║██║  ██║╚██████╗██║  ██╗███████╗██║  ██║
╚══════╝   ╚═╝   ╚══════╝╚═╝  ╚═╝╚═╝     ╚═╝     ╚═════╝╚═╝  ╚═╝╚═╝  ╚═╝ ╚═════╝╚═╝  ╚═╝╚══════╝╚═╝  ╚═╝
""")
print("愿你的系统永远无忧，游戏世界充满奇迹！")

print("""
该脚本由Hickerzed提供，仅供广大游戏玩家能够游玩价格昂贵的精品游戏，
若经济支持请购买正版游戏游玩
""")
print("需知：本产品并不适用于所有游戏，但大部分游戏支持直接使用该方式启动，少部分游戏需要进行脱壳操作\n")
print("使用方式：假设你的Steam安装在D盘，那么请你依次找到如下的文件夹路径“D:\Steam\steamapps\common”\n")
print("随后找到你想游玩的游戏并点击打开他的目录文件夹，找到他的exe可执行文件点击即可")
print(r"""
██╗  ██╗██╗ ██████╗██╗  ██╗███████╗██████╗ ███████╗███████╗██████╗ 
██║  ██║██║██╔════╝██║ ██╔╝██╔════╝██╔══██╗╚══███╔╝██╔════╝██╔══██╗
███████║██║██║     █████╔╝ █████╗  ██████╔╝  ███╔╝ █████╗  ██║  ██║
██╔══██║██║██║     ██╔═██╗ ██╔══╝  ██╔══██╗ ███╔╝  ██╔══╝  ██║  ██║
██║  ██║██║╚██████╗██║  ██╗███████╗██║  ██║███████╗███████╗██████╔╝
╚═╝  ╚═╝╚═╝ ╚═════╝╚═╝  ╚═╝╚══════╝╚═╝  ╚═╝╚══════╝╚══════╝╚═════╝ 
                                                                   
""")

def browseFiles():
    filename = filedialog.askopenfilename(initialdir="/",
                                          title="Steam Cracker",
                                          filetypes=(("EXE files",
                                                      "*.exe*"),
                                                     ("all files",
                                                      "*.*")))
    os.system(f'"{filename}"')

# 创建根窗口并隐藏它
root = Tk()
root.withdraw()

while True:
    browseFiles()
